Tekla Open API Reference for Tekla Structures 2025
BendSurface Properties
The BendSurface type exposes the following members.
Properties
Name | Description
CenterLine
 Gets the center line of the bend surface (i.e. the line that crosses every circular cross section of the bend at their center point)
EndFaceNormal1
 Gets the first end face normal.
EndFaceNormal2
 Gets the second end face normal.
IntersectionLine
 Gets intersection line.
InwardCurved
 Gets the direction of the curve - true if the curve is oriented towards the intersection line, false otherwise.
LateralBoundary1
 Gets or sets the first lateral boundary
LateralBoundary2
 Gets or sets the second lateral boundary
RotationAxis
 Gets the unit vector that defines the rotation axis (for counter clockwise rotations) of the lateral boundaries of the surface. This axis is always parallel to the direction of the center line.
SideBoundary1
 Gets or sets the first side boundary.
SideBoundary2
 Gets or sets the second side boundary.
Top
See Also
Reference
BendSurface Class
Tekla.Structures.Model Namespace